particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    /* Characteristic metadata */
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.broadcast      = (properties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
    char_md.char_props.read           = (properties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
    char_md.char_props.write_wo_resp  = (properties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
    char_md.char_props.write          = (properties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
    char_md.char_props.notify         = (properties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
    char_md.char_props.indicate       = (properties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
    char_md.char_props.auth_signed_wr = (properties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
    // User Description Descriptor
    if (desc != NULL) {
        memset(&user_desc_attr_md, 0, sizeof(user_desc_attr_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&user_desc_attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&user_desc_attr_md.write_perm);
        user_desc_attr_md.vloc    = BLE_GATTS_VLOC_STACK;
        user_desc_attr_md.rd_auth = 0;
        user_desc_attr_md.wr_auth = 0;
        user_desc_attr_md.vlen    = 0;

        char_md.p_char_user_desc        = (const uint8_t *)desc;
        char_md.char_user_desc_max_size = strlen(desc);
        char_md.char_user_desc_size     = strlen(desc);
        char_md.p_user_desc_md          = &user_desc_attr_md;
    }
    else {
        char_md.p_char_user_desc = NULL;
        char_md.p_user_desc_md   = NULL;
    }
    // Client Characteristic Configuration Descriptor
    if (char_md.char_props.notify || char_md.char_props.indicate) {
        memset(&cccd_attr_md, 0, sizeof(cccd_attr_md));
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_attr_md.read_perm);
        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_attr_md.write_perm);
        cccd_attr_md.vloc = BLE_GATTS_VLOC_STACK;

        char_md.p_cccd_md = &cccd_attr_md;
    }
    // TODO:
    char_md.p_char_pf = NULL;
    char_md.p_sccd_md = NULL;

    /* Characteristic value attribute metadata */
    memset(&value_attr_md, 0, sizeof(value_attr_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&value_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&value_attr_md.write_perm);
    value_attr_md.vloc    = BLE_GATTS_VLOC_STACK;
    value_attr_md.rd_auth = 0;
    value_attr_md.wr_auth = 0;
    value_attr_md.vlen    = 1;

    /* Characteristic value attribute */
    memset(&char_value_attr, 0, sizeof(char_value_attr));
    char_value_attr.p_uuid    = uuid;
    char_value_attr.p_attr_md = &value_attr_md;
    char_value_attr.init_len  = 0;
    char_value_attr.init_offs = 0;
    char_value_attr.max_len   = BLE_MAX_CHAR_VALUE_LEN;
    char_value_attr.p_value   = NULL;

    ret = sd_ble_gatts_characteristic_add(service_handle, &char_md, &char_value_attr, &char_handles);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_characteristic_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    ble_char->properties       = properties;
    ble_char->value_handle     = char_handles.value_handle;
    ble_char->user_desc_handle = char_handles.user_desc_handle;
    ble_char->cccd_handle      = char_handles.cccd_handle;
    ble_char->sccd_handle      = char_handles.sccd_handle;

    LOG_DEBUG(TRACE, "Characteristic value handle: %d.", char_handles.value_handle);
    LOG_DEBUG(TRACE, "Characteristic cccd handle: %d.", char_handles.cccd_handle);

    return SYSTEM_ERROR_NONE;
}

static void dispatchBleEvent(hal_ble_event_t* evt) {
    for (uint8_t i = 0; i < BLE_MAX_EVENT_CALLBACK_COUNT; i++) {
        if (s_bleEvtCallbacks[i] != NULL) {
            s_bleEvtCallbacks[i](evt);
        }
    }
}

static void isrProcessBleEvent(const ble_evt_t* event, void* context) {
    ret_code_t      ret;
    hal_ble_event_t bleEvt;

    switch (event->header.evt_id) {
        case BLE_GAP_EVT_ADV_SET_TERMINATED: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising stopped.");
            s_bleStatus.advertising = false;
        } break;

        case BLE_GAP_EVT_ADV_REPORT: {
            LOG_DEBUG(TRACE, "BLE GAP event: advertising report.");

            bleEvt.evt_type = BLE_EVT_TYPE_SCAN_RESULT;
            if (event->evt.gap_evt.params.adv_report.type.scan_response) {
                bleEvt.scan_result_event.data_type = BLE_SCAN_RESULT_EVT_DATA_TYPE_SCAN_RESP;
            }
            else {
                bleEvt.scan_result_event.data_type = BLE_SCAN_RESULT_EVT_DATA_TYPE_ADV;
            }
            bleEvt.scan_result_event.peer_addr.addr_type = event->evt.gap_evt.params.adv_report.peer_addr.addr_type;
            memcpy(bleEvt.scan_result_event.peer_addr.addr, event->evt.gap_evt.params.adv_report.peer_addr.addr, BLE_SIG_ADDR_LEN);
            bleEvt.scan_result_event.rssi = event->evt.gap_evt.params.adv_report.rssi;
            bleEvt.scan_result_event.data_len = event->evt.gap_evt.params.adv_report.data.len;
            memcpy(bleEvt.scan_result_event.data, event->evt.gap_evt.params.adv_report.data.p_data, bleEvt.scan_result_event.data_len);
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }

            // Continue scanning, scanning parameters pointer must be set to NULL.
            ret_code_t ret = sd_ble_gap_scan_start(NULL, &s_bleScanData);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_scan_start() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_CONNECTED: {
            // FIXME: If multi role is enabled, this flag should not be clear here.
            s_bleStatus.advertising = false;

            LOG_DEBUG(TRACE, "BLE GAP event: connected.");

            s_bleStatus.role             = event->evt.gap_evt.params.connected.role;
            s_bleStatus.conn_handle      = event->evt.gap_evt.conn_handle;
            memcpy(&s_bleStatus.conn_params, &event->evt.gap_evt.params.connected.conn_params, sizeof(ble_gap_conn_params_t));

            LOG_DEBUG(TRACE, "BLE role: %d, connection handle: %d", s_bleStatus.role, s_bleStatus.conn_handle);
            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %.2f          %d       %d",
                    s_bleStatus.conn_params.max_conn_interval*1.25,
                    s_bleStatus.conn_params.slave_latency,
                    s_bleStatus.conn_params.conn_sup_timeout*10);

            // Update connection parameters if needed.
            s_connParamsUpdateAttempts = 0;
            updateConnParamsIfNeeded();

            bleEvt.evt_type               = BLE_EVT_TYPE_CONNECTION;
            bleEvt.conn_event.conn_handle = s_bleStatus.conn_handle;
            bleEvt.conn_event.evt_id      = BLE_CONN_EVT_ID_CONNECTED;
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }
        } break;

        case BLE_GAP_EVT_DISCONNECTED: {
            LOG_DEBUG(TRACE, "BLE GAP event: disconnected, handle: 0x%04X, reason: %d",
                      event->evt.gap_evt.conn_handle,
                      event->evt.gap_evt.params.disconnected.reason);

            // Stop the connection parameters update timer.
            if (!os_timer_is_active(s_connParamsUpdateTimer, NULL)) {
                os_timer_change(s_connParamsUpdateTimer, OS_TIMER_CHANGE_STOP, true, 0, 0, NULL);
            }

            bleEvt.evt_type               = BLE_EVT_TYPE_CONNECTION;
            bleEvt.conn_event.conn_handle = s_bleStatus.conn_handle;
            bleEvt.conn_event.evt_id      = BLE_CONN_EVT_ID_DISCONNECTED;
            bleEvt.conn_event.reason      = event->evt.gap_evt.params.disconnected.reason;
            if (os_queue_put(s_bleEvtQueue, &bleEvt, 0, NULL)) {
                LOG(ERROR, "os_queue_put() failed.");
            }

            s_bleStatus.conn_handle = BLE_INVALID_CONN_HANDLE;
            s_bleStatus.role = BLE_ROLE_INVALID;

            // Re-start advertising.
            LOG_DEBUG(TRACE, "Restart BLE advertising.");
            ret = sd_ble_gap_adv_start(s_advHandle, BLE_CONN_CFG_TAG);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_adv_start() failed: %u", (unsigned)ret);
            }
            else {
                s_bleStatus.advertising = true;
            }
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: connection parameter updated.");

            memcpy(&s_bleStatus.conn_params, &event->evt.gap_evt.params.conn_param_update.conn_params, sizeof(ble_gap_conn_params_t));

            LOG_DEBUG(TRACE, "| interval(ms)  latency  timeout(ms) |");
            LOG_DEBUG(TRACE, "  %.2f          %d       %d",
                    s_bleStatus.conn_params.max_conn_interval*1.25,
                    s_bleStatus.conn_params.slave_latency,
                    s_bleStatus.conn_params.conn_sup_timeout*10);

            // Update connection parameters if needed.
            updateConnParamsIfNeeded();
        } break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical update request.");
            ble_gap_phys_t phys = {};
            phys.rx_phys = BLE_GAP_PHY_AUTO;
            phys.tx_phys = BLE_GAP_PHY_AUTO;
            ret = sd_ble_gap_phy_update(event->evt.gap_evt.conn_handle, &phys);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_phy_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_PHY_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: physical updated.");
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length updated.");
            LOG_DEBUG(TRACE, "| txo    rxo     txt(us)     rxt(us) |.");
            LOG_DEBUG(TRACE, "  %d    %d     %d        %d",
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_rx_octets,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_tx_time_us,
                    event->evt.gap_evt.params.data_length_update.effective_params.max_rx_time_us);
        } break;

        case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: gap data length update request.");

            ble_gap_data_length_params_t gapDataLenParams;
            gapDataLenParams.max_tx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_octets  = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_tx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            gapDataLenParams.max_rx_time_us = BLE_GAP_DATA_LENGTH_AUTO;
            ret_code_t ret = sd_ble_gap_data_length_update(event->evt.gap_evt.conn_handle, &gapDataLenParams, NULL);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_data_length_update() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_SEC_PARAMS_REQUEST: {
            LOG_DEBUG(TRACE, "BLE GAP event: security parameters request.");

            // Pairing is not supported
            ret_code_t ret = sd_ble_gap_sec_params_reply(event->evt.gap_evt.conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, nullptr, nullptr);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_sec_params_reply() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GAP_EVT_AUTH_STATUS: {
            LOG_DEBUG(TRACE, "BLE GAP event: authentication status updated.");

            if (event->evt.gap_evt.params.auth_status.auth_status == BLE_GAP_SEC_STATUS_SUCCESS) {
                LOG_DEBUG(TRACE, "Authentication succeeded");
            }
            else {
                LOG_DEBUG(WARN, "Authentication failed, status: %d", (int)event->evt.gap_evt.params.auth_status.auth_status);
            }
        } break;

        case BLE_GAP_EVT_TIMEOUT: {
            if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN) {
                LOG_DEBUG(TRACE, "BLE GAP event: Scanning timeout");
                s_bleStatus.scanning = false;
            }
            else if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN) {
                LOG_DEBUG(ERROR, "BLE GAP event: Connection timeout");
            }
            else if (event->evt.gap_evt.params.timeout.src == BLE_GAP_TIMEOUT_SRC_AUTH_PAYLOAD) {
                LOG_DEBUG(ERROR, "BLE GAP event: Authenticated payload timeout");
            }
            else {
                LOG_DEBUG(ERROR, "BLE GAP event: Unknown timeout, source: %d", event->evt.gap_evt.params.timeout.src);
            }
        } break;

        case BLE_GATTC_EVT_EXCHANGE_MTU_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: exchange ATT MTU response.");
            LOG_DEBUG(TRACE, "Effective Server RX MTU: %d.", event->evt.gattc_evt.params.exchange_mtu_rsp.server_rx_mtu);
        } break;

        case BLE_GATTC_EVT_TIMEOUT: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: timeout, conn handle: %d, source: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.timeout.src);

            // Disconnect on GATT Client timeout event.
            ret = sd_ble_gap_disconnect(event->evt.gattc_evt.conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (ret != NRF_SUCCESS) {
                LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            }
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING: {
            LOG_DEBUG(TRACE, "BLE GATT Server event: system attribute is missing.");

