particle-iot/device-os/hal/src/nRF52840/ble_hal_api.cpp
    ble_uuid128_t uuid;
    memcpy(uuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);
    ret = sd_ble_uuid_vs_add(&uuid, &charUuid.type);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_uuid_vs_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    ret = sd_ble_uuid_decode(BLE_SIG_UUID_128BIT_LEN, uuid128, &charUuid);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_uuid_decode() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    int error = addCharacteristic(service_handle, &charUuid, properties, desc, ble_char);
    if (SYSTEM_ERROR_NONE == error) {
        ble_char->uuid.type = BLE_UUID_TYPE_128BIT;
        memcpy(ble_char->uuid.uuid128, uuid128, BLE_SIG_UUID_128BIT_LEN);
    }

    return error;
}

int ble_add_char_uuid16(uint16_t service_handle, uint16_t uuid16, uint8_t properties, const char* desc, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_add_char_uuid16().");

    if (ble_char == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_uuid_t charUuid;
    charUuid.type = BLE_UUID_TYPE_BLE;
    charUuid.uuid = uuid16;

    int error = addCharacteristic(service_handle, &charUuid, properties, desc, ble_char);
    if (SYSTEM_ERROR_NONE == error) {
        ble_char->uuid.type   = BLE_UUID_TYPE_16BIT;
        ble_char->uuid.uuid16 = uuid16;
    }

    return error;
}

int ble_add_char_desc(uint8_t* desc, uint16_t len, hal_ble_char_t* ble_char) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_add_char_desc().");

    if (ble_char == NULL || desc == NULL || ble_char->value_handle == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ret_code_t ret;
    ble_gatts_attr_t desc_attr;
    ble_gatts_attr_md_t desc_attr_md;
    ble_uuid_t descUuid;

    if (ble_char->uuid.type == BLE_UUID_TYPE_16BIT) {
        descUuid.type = BLE_UUID_TYPE_BLE;
        descUuid.uuid = ble_char->uuid.uuid16;
    }
    else {
        ret = sd_ble_uuid_decode(BLE_SIG_UUID_128BIT_LEN, ble_char->uuid.uuid128, &descUuid);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_decode() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
    }

    memset(&desc_attr_md, 0, sizeof(desc_attr_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&desc_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&desc_attr_md.write_perm);
    desc_attr_md.vloc = BLE_GATTS_VLOC_STACK;
    desc_attr_md.rd_auth = 0;
    desc_attr_md.wr_auth = 0;
    desc_attr_md.vlen    = 0;

    memset(&desc_attr, 0, sizeof(desc_attr));
    desc_attr.p_uuid    = &descUuid;
    desc_attr.p_attr_md = &desc_attr_md;
    desc_attr.init_len  = len;
    desc_attr.init_offs = 0;
    desc_attr.max_len   = len;
    desc_attr.p_value   = desc;

    ret = sd_ble_gatts_descriptor_add(ble_char->value_handle, &desc_attr, &ble_char->user_desc_handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_descriptor_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

int ble_publish(hal_ble_char_t* ble_char, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_publish().");

    if (ble_char == NULL || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (!(ble_char->properties & BLE_SIG_CHAR_PROP_NOTIFY) && !(ble_char->properties & BLE_SIG_CHAR_PROP_INDICATE)) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }

    if (s_bleStatus.conn_handle == BLE_INVALID_CONN_HANDLE) {
        return SYSTEM_ERROR_INVALID_STATE;
    }

    // Check if the client has enabled notification or indication
    uint8_t cccd[2];
    ble_gatts_value_t gattValue;
    gattValue.p_value = cccd;
    gattValue.len = sizeof(cccd);
    gattValue.offset = 0;
    ret_code_t ret = sd_ble_gatts_value_get(s_bleStatus.conn_handle, ble_char->cccd_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_get() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    uint16_t cccd_value = uint16_decode(cccd);
    if (cccd_value == BLE_SIG_CCCD_VAL_DISABLED || cccd_value > BLE_SIG_CCCD_VAL_INDICATION || !s_bleStatus.ind_confirmed) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    else {
        ble_gatts_hvx_params_t hvxParams;

        if (cccd_value == BLE_SIG_CCCD_VAL_NOTIFICATION) {
            hvxParams.type = BLE_GATT_HVX_NOTIFICATION;
        }
        else {
            // Only one indication procedure can be ongoing per connection at a time.
            hvxParams.type = BLE_GATT_HVX_INDICATION;
        }

        uint16_t hvxLen = len;
        hvxParams.handle = ble_char->value_handle;
        hvxParams.offset = 0;
        hvxParams.p_data = data;
        hvxParams.p_len  = &hvxLen;

        ret_code_t ret = sd_ble_gatts_hvx(s_bleStatus.conn_handle, &hvxParams);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gatts_hvx() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        if (cccd_value == BLE_SIG_CCCD_VAL_INDICATION) {
            s_bleStatus.ind_confirmed = false;
        }
    }

    return SYSTEM_ERROR_NONE;
}

int ble_set_characteristic_value(hal_ble_char_t* ble_char, uint8_t* data, uint16_t len) {
    std::lock_guard<bleLock> lk(bleLock());
    SPARK_ASSERT(s_bleStatus.initialized);

    LOG_DEBUG(TRACE, "ble_set_characteristic_value().");

    if (ble_char == NULL || data == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    ble_gatts_value_t gattValue;
    gattValue.len     = len;
    gattValue.offset  = 0;
    gattValue.p_value = data;

    ret_code_t ret = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, ble_char->value_handle, &gattValue);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_value_set() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    return SYSTEM_ERROR_NONE;
}

